СРО_Копия/src/Reports/СРО_ОтчетРезюме/СРО_ОтчетРезюме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СРО_ОтчетРезюме</name>
  <tabularSections>
    <name>ТаблицаОтчетности</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>EnumRef.ВидыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КПКПолноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПКИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КПКОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетнаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПККраткоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПКДатаВступленияВСРО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПКДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеНаправления</name>
      <type>
        <types>EnumRef.ОснованияНаправления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсходящегоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>EnumRef.ТипДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>СРОНомерВРесстреСРО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСостояния</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодДокумента</name>
      <type>
        <types>EnumRef.КодДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПакетаДокументов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтчетности</name>
      <type>
        <types>DocumentRef.ОтчетностьКПК</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаполненныеРазделы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеИмяАрхива</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

СРО_Копия/src/Catalogs/Разделы/Разделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Разделы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Раздел1</name>
      <description>Раздел 1</description>
    </items>
    <items>
      <name>Раздел10</name>
      <description>Раздел 10</description>
    </items>
    <items>
      <name>Раздел11</name>
      <description>Раздел 11</description>
    </items>
    <items>
      <name>Раздел12</name>
      <description>Раздел 12</description>
    </items>
    <items>
      <name>Раздел13</name>
      <description>Раздел 13</description>
    </items>
    <items>
      <name>Раздел2</name>
      <description>Раздел 2</description>
        </content>
          </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
          </content>
          </content>
        </content>
          </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел3</name>
      <description>Раздел 3</description>
      </content>
        </content>
      </content>
        </content>
      </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел4</name>
      <description>Раздел 4</description>
      </content>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
        </content>
        </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел5</name>
      <description>Раздел 5</description>
      </content>
    </items>
    <items>
      <name>Раздел6</name>
      <description>Раздел 6</description>
      </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел7</name>
      <description>Раздел 7</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел8</name>
      <description>Раздел 8</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел9</name>
      <description>Раздел 9</description>
      </content>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРаздела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СРО_Копия/src/Reports/СРО_ОтчетРезюме/ManagerModule.bsl
Процедура ЗаполнитьНаСервере_ФайлыКаталог(СтруктураПараметров)	
	
	ВремДерево = СтруктураПараметров.ВремДерево;  	
	ВремТаблицаОтчетности = СтруктураПараметров.ВремТаблицаОтчетности;    	
	                                                                                     
	ПутьККаталогуФайлуЗагрузки = СтруктураПараметров.ПутьККаталогуФайлуЗагрузки;
	ВидЗагрузки = СтруктураПараметров.ВидЗагрузки;   	
	флОтборПоПериоду = СтруктураПараметров.флОтборПоПериоду;   		
	
	ДатаНачала = СтруктураПараметров.ДатаНачалаОтчета;
	ДатаОкончания = СтруктураПараметров.ДатаОкончанияОтчета;
	
	СтруктураПараметровДляЗаполнения = Новый Структура;
	СтруктураПараметровДляЗаполнения.Вставить("ПутьККаталогуФайлуЗагрузки", ПутьККаталогуФайлуЗагрузки);
	СтруктураПараметровДляЗаполнения.Вставить("ЗаписьЭлектроннойПочты", "");
	СтруктураПараметровДляЗаполнения.Вставить("ВидЗагрузки", ВидЗагрузки);
	СтруктураПараметровДляЗаполнения.Вставить("ТаблицаОтчетности", ВремТаблицаОтчетности);      	
	
	СРО_ЗагрузкаОтчетности.ЗаполнитьНаСервере(СтруктураПараметровДляЗаполнения);		
	
	ВремТаблицаОтчетности = СтруктураПараметровДляЗаполнения.ТаблицаОтчетности;
	
	Если ВремТаблицаОтчетности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;    
		
	ВремТаблица = ВремТаблицаОтчетности.СкопироватьКолонки("Период, СРОНомерВРесстреСРО, КПКИНН, КПКОГРН, КПККраткоеНаименование, ДатаИсходящегоДокумента, КодДокумента, ПолноеИмяФайла");
	
	Для Каждого ТекСтрока ИЗ ВремТаблицаОтчетности Цикл
		
		Если флОтборПоПериоду И (ТекСтрока.Период < ДатаНачала ИЛИ ТекСтрока.Период > ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ВремДерево.Строки.НайтиСтроки(Новый Структура("КПКИНН, КПКОГРН", ТекСтрока.КПКИНН, ТекСтрока.КПКОГРН));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ВремДерево.Строки.Добавить();  			
			НоваяСтрока.СРОНомерВРесстреСРО = ТекСтрока.СРОНомерВРесстреСРО;
			НоваяСтрока.КПКИНН = ТекСтрока.КПКИНН;
			НоваяСтрока.КПКОГРН = ТекСтрока.КПКОГРН;   	
			НоваяСтрока.КПККраткоеНаименование = ТекСтрока.КПККраткоеНаименование;
		КонецЕсли; 				
	КонецЦикла;
	
	ВремТаблицаОтчетности.Сортировать("Период");
	
	Для Каждого СтрокаДерева ИЗ ВремДерево.Строки Цикл
		
		НайденныеСтроки = ВремТаблицаОтчетности.НайтиСтроки(Новый Структура("КПКИНН, КПКОГРН", СтрокаДерева.КПКИНН, СтрокаДерева.КПКОГРН));
		
		Для Каждого ЭлементМассива ИЗ НайденныеСтроки Цикл
			СтрокаДокумента = СтрокаДерева.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, ЭлементМассива);
			
			//СтрокаДокумента.Период = ЭлементМассива.Период;
			//СтрокаДокумента.ДатаИсходящегоДокумента = ЭлементМассива.ДатаИсходящегоДокумента;
			//СтрокаДокумента.КодДокумента = ЭлементМассива.КодДокумента;
		КонецЦикла;     		
	КонецЦикла;    
	
	СтруктураПараметров.ВремДерево = ВремДерево;  	
	
КонецПроцедуры


Процедура ЗаполнитьНаСервере_ДокументыОтчетности(СтруктураПараметров)
	
	ВремДерево = СтруктураПараметров.ВремДерево;  	
	ВремТаблицаОтчетности = СтруктураПараметров.ВремТаблицаОтчетности;  
	
	ДатаНачала = СтруктураПараметров.ДатаНачалаОтчета;
	ДатаОкончания = КонецДня(СтруктураПараметров.ДатаОкончанияОтчета);   
	МассивКПК = СтруктураПараметров.МассивКПК;  	
	флОтборПоПериоду = СтруктураПараметров.флОтборПоПериоду;  
			
	СтруктураПараметровДляЗаполнения = Новый Структура;
	СтруктураПараметровДляЗаполнения.Вставить("ДатаНачалаОтчета", ДатаНачала);
	СтруктураПараметровДляЗаполнения.Вставить("ДатаОкончанияОтчета", ДатаОкончания);
	СтруктураПараметровДляЗаполнения.Вставить("МассивКПК", МассивКПК);  	
	СтруктураПараметровДляЗаполнения.Вставить("ТаблицаОтчетности", ВремТаблицаОтчетности);      	
	
	СРО_ЗагрузкаОтчетности.ЗаполнитьНаСервере_ТаблицаДокументовОтчетности(СтруктураПараметровДляЗаполнения);		
	
	ВремТаблицаОтчетности = СтруктураПараметровДляЗаполнения.ТаблицаОтчетности;
	
	Если ВремТаблицаОтчетности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;    
		
	ВремТаблица = ВремТаблицаОтчетности.СкопироватьКолонки("Период, СРОНомерВРесстреСРО, КПКИНН, КПКОГРН, КПККраткоеНаименование, ДатаИсходящегоДокумента, КодДокумента, ПолноеИмяФайла, ДокументОтчетности");
	
	Для Каждого ТекСтрока ИЗ ВремТаблицаОтчетности Цикл
		
		Если флОтборПоПериоду И (ТекСтрока.Период < ДатаНачала ИЛИ ТекСтрока.Период > ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ВремДерево.Строки.НайтиСтроки(Новый Структура("КПКИНН, КПКОГРН", ТекСтрока.КПКИНН, ТекСтрока.КПКОГРН));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ВремДерево.Строки.Добавить();  			
			НоваяСтрока.СРОНомерВРесстреСРО = ТекСтрока.СРОНомерВРесстреСРО;
			НоваяСтрока.КПКИНН = ТекСтрока.КПКИНН;
			НоваяСтрока.КПКОГРН = ТекСтрока.КПКОГРН;   	
			НоваяСтрока.КПККраткоеНаименование = ТекСтрока.КПККраткоеНаименование;
		КонецЕсли; 				
	КонецЦикла;
	
	ВремТаблицаОтчетности.Сортировать("Период");
	
	Для Каждого СтрокаДерева ИЗ ВремДерево.Строки Цикл
		
		НайденныеСтроки = ВремТаблицаОтчетности.НайтиСтроки(Новый Структура("КПКИНН, КПКОГРН", СтрокаДерева.КПКИНН, СтрокаДерева.КПКОГРН));
		
		Для Каждого ЭлементМассива ИЗ НайденныеСтроки Цикл
			СтрокаДокумента = СтрокаДерева.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, ЭлементМассива);
			
			//СтрокаДокумента.Период = ЭлементМассива.Период;
			//СтрокаДокумента.ДатаИсходящегоДокумента = ЭлементМассива.ДатаИсходящегоДокумента;
			//СтрокаДокумента.КодДокумента = ЭлементМассива.КодДокумента;
		КонецЦикла;     		
	КонецЦикла;    	
	
	СтруктураПараметров.ВремДерево = ВремДерево;   
	
КонецПроцедуры


Процедура ЗаполнитьТаблицуДокументов(СтруктураПараметров) Экспорт	      
	
	Если СтруктураПараметров.ИсточникОтчета = 0 Тогда
		ЗаполнитьНаСервере_ФайлыКаталог(СтруктураПараметров);
	Иначе	
		ЗаполнитьНаСервере_ДокументыОтчетности(СтруктураПараметров);
	КонецЕсли; 	    
	
КонецПроцедуры


Функция СформироватьТабличныеДокументы(СтруктураПараметров) Экспорт
	
	ДатаНачала = СтруктураПараметров.ДатаНачалаОтчета;
	ДатаОкончания = КонецДня(СтруктураПараметров.ДатаОкончанияОтчета);
	МассивКПК = СтруктураПараметров.МассивКПК;	
	
	Если НЕ СтруктураПараметров.Свойство("ВремДерево") Тогда   		
		ВремДерево = СРО_ЗагрузкаОтчетности.ИнициализироватьДеревоДокументов();
		СтруктураПараметров.Вставить("ВремДерево", ВремДерево);
	Иначе
		ВремДерево = СтруктураПараметров.ВремДерево;
	КонецЕсли;     	
	
	Если НЕ СтруктураПараметров.Свойство("ВремТаблицаОтчетности") Тогда   		
		ВремТаблицаОтчетности = СРО_ЗагрузкаОтчетности.ИнициализироватьТаблицуОтчетности();
		СтруктураПараметров.Вставить("ВремТаблицаОтчетности", ВремТаблицаОтчетности);
	КонецЕсли;     	
	
	Если НЕ СтруктураПараметров.Свойство("ПутьККаталогуФайлуЗагрузки") Тогда
		СтруктураПараметров.Вставить("ПутьККаталогуФайлуЗагрузки", "");
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ВидЗагрузки") Тогда
		СтруктураПараметров.Вставить("ВидЗагрузки", 0);
	КонецЕсли;   
	
	Если НЕ СтруктураПараметров.Свойство("флОтборПоПериод") Тогда
		СтруктураПараметров.Вставить("флОтборПоПериоду", Истина);
	КонецЕсли;  
	
	Если НЕ СтруктураПараметров.Свойство("ИсточникОтчета") Тогда   		
		СтруктураПараметров.Вставить("ИсточникОтчета", 1);
	КонецЕсли;                                                  	
	
	Если НЕ СтруктураПараметров.Свойство("ЭтоРассылкаОтчета") Тогда   		
		СтруктураПараметров.Вставить("ЭтоРассылкаОтчета", Ложь);
	КонецЕсли;  
	
	Если НЕ СтруктураПараметров.Свойство("СформироватьФормуПроверки") Тогда   		
		СтруктураПараметров.Вставить("СформироватьФормуПроверки", Ложь);
	КонецЕсли;   	                                             	
	 	
	// заполняем таблицу
	
	Если СтруктураПараметров.ЭтоРассылкаОтчета 
		И СтруктураПараметров.ИсточникОтчета = 1 Тогда
		
		ЗаполнитьТаблицуДокументов(СтруктураПараметров);   
		
		ВремДерево = СтруктураПараметров.ВремДерево;
		Для Каждого СтрокаКПК ИЗ ВремДерево.Строки Цикл	
			Для Каждого СтрокаДокумент ИЗ СтрокаКПК.Строки Цикл							
				СтрокаДокумент.Флаг = Истина;                           				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
//	Макет = Отчеты.СРО_СводныйНФ.ПолучитьМакет("Макет"); 		

	МассивТабличныхДокументов = Новый Массив;

	//ВремДерево = РеквизитФормыВЗначение("ДеревоДокументов"); 
	
	МассивРазделовДляЗапроса = Новый Массив;
	МассивРазделовДляЗапроса.Добавить(Справочники.Разделы.Раздел2);
	МассивРазделовДляЗапроса.Добавить(Справочники.Разделы.Раздел3);
	МассивРазделовДляЗапроса.Добавить(Справочники.Разделы.Раздел4);
	МассивРазделовДляЗапроса.Добавить(Справочники.Разделы.Раздел8);
	МассивРазделовДляЗапроса.Добавить(Справочники.Разделы.Раздел9);
	МассивРазделовДляЗапроса.Добавить(Справочники.Разделы.Раздел11);   
	
	Для Каждого СтрокаКПК ИЗ ВремДерево.Строки Цикл	
		Для Каждого СтрокаДокумент ИЗ СтрокаКПК.Строки Цикл			
			ПолноеИмяФайла = СокрЛП(СтрокаДокумент.ПолноеИмяФайла);
			
			Если СтрокаДокумент.Флаг Тогда  
				
				СтруктураПараметровОтчета = Новый Структура;
				СтруктураПараметровОтчета.Вставить("ОтчетныйПериод", СтрокаДокумент.Период);   
				СтруктураПараметровОтчета.Вставить("КПКИНН", СтрокаДокумент.КПКИНН);
				СтруктураПараметровОтчета.Вставить("КПКОГРН", СтрокаДокумент.КПКОГРН);
				СтруктураПараметровОтчета.Вставить("КПККраткоеНаименование", СтрокаКПК.КПККраткоеНаименование);
				СтруктураПараметровОтчета.Вставить("СРОНомерВРесстреСРО", СтрокаДокумент.СРОНомерВРесстреСРО);
				СтруктураПараметровОтчета.Вставить("КодДокумента", СтрокаДокумент.КодДокумента);
				СтруктураПараметровОтчета.Вставить("МассивТабличныхДокументов", МассивТабличныхДокументов);
				
				СтруктураПараметровОтчета.Вставить("ИсточникОтчета", СтруктураПараметров.ИсточникОтчета);				
					
				СтруктураПараметровОтчета.Вставить("МассивРазделовДляЗапроса", МассивРазделовДляЗапроса);					
				СтруктураПараметровОтчета.Вставить("СформироватьФормуПроверки", СтруктураПараметров.СформироватьФормуПроверки);	
				
				Если СтруктураПараметров.ИсточникОтчета = 0 Тогда
					СтруктураПараметровОтчета.Вставить("ПолноеИмяФайла", СтрокаДокумент.ПолноеИмяФайла);
				Иначе				
					СтруктураПараметровОтчета.Вставить("ДокументОтчетности", СтрокаДокумент.ДокументОтчетности);
				КонецЕсли;  					
				
				СРО_ЗагрузкаОтчетности.ВывестиРезюме(СтруктураПараметровОтчета);
				
				МассивТабличныхДокументов =  СтруктураПараметровОтчета.МассивТабличныхДокументов;
				
			КонецЕсли;
		КонецЦикла; 		                             	
	КонецЦикла;
	
	Возврат МассивТабличныхДокументов;

КонецФункции
